In [1]:
import pandas as pd
import numpy as np

In [108]:
from datetime import datetime
dateparse = lambda x: datetime.timestamp(datetime.strptime(x, '%Y-%m-%d'))

df = pd.read_csv('a10.csv', index_col='date')#, parse_dates=['date'], date_parser=dateparse)

In [92]:
ts = datetime.timestamp(datetime.strptime('1991-07-01', '%Y-%m-%d'))
dt_object = datetime.fromtimestamp(ts)
dt_object

datetime.datetime(1991, 7, 1, 0, 0)

In [109]:
df

                value
date
1991-07-01   3.526591
1991-08-01   3.180891
1991-09-01   3.252221
1991-10-01   3.611003
1991-11-01   3.565869
...               ...
2008-02-01  21.654285
2008-03-01  18.264945
2008-04-01  23.107677
2008-05-01  22.912510
2008-06-01  19.431740

[204 rows x 1 columns]

In [110]:
# Let's keep the last 40% of the values out for testing purposes
train_size = 0.6
index = round(train_size*df.shape[0])

df_train = df.iloc[:index]
df_test = df.iloc[index:]

In [111]:
df_test

                value
date
2001-09-01  10.647060
2001-10-01  12.652134
2001-11-01  13.674466
2001-12-01  12.965735
2002-01-01  16.300269
...               ...
2008-02-01  21.654285
2008-03-01  18.264945
2008-04-01  23.107677
2008-05-01  22.912510
2008-06-01  19.431740

[82 rows x 1 columns]

In [112]:
y_pred = df_test.shift(1)
y_pred

                value
date
2001-09-01        NaN
2001-10-01  10.647060
2001-11-01  12.652134
2001-12-01  13.674466
2002-01-01  12.965735
...               ...
2008-02-01  29.665356
2008-03-01  21.654285
2008-04-01  18.264945
2008-05-01  23.107677
2008-06-01  22.912510

[82 rows x 1 columns]

In [106]:
from sklearn.metrics import r2_score

y_pred = df_test.shift(1).dropna()
y_true = df_test[1:]

print(f"R2: {r2_score(y_true, y_pred)}")

ValueError: could not convert string to float: '2001-10-01'

In [41]:
y_pred = df_test.shift(1).dropna()
y_pred

           date      value
123  2001-09-01  10.647060
124  2001-10-01  12.652134
125  2001-11-01  13.674466
126  2001-12-01  12.965735
127  2002-01-01  16.300269
..          ...        ...
199  2008-01-01  29.665356
200  2008-02-01  21.654285
201  2008-03-01  18.264945
202  2008-04-01  23.107677
203  2008-05-01  22.912510

[81 rows x 2 columns]

In [98]:
y_true = df_test[1:]
y_true

                                   date      value
123  (2001, 10, 1, 0, 0, 0, 0, 274, -1)  12.652134
124  (2001, 11, 1, 0, 0, 0, 3, 305, -1)  13.674466
125  (2001, 12, 1, 0, 0, 0, 5, 335, -1)  12.965735
126     (2002, 1, 1, 0, 0, 0, 1, 1, -1)  16.300269
127    (2002, 2, 1, 0, 0, 0, 4, 32, -1)   9.053485
..                                  ...        ...
199    (2008, 2, 1, 0, 0, 0, 4, 32, -1)  21.654285
200    (2008, 3, 1, 0, 0, 0, 5, 61, -1)  18.264945
201    (2008, 4, 1, 0, 0, 0, 1, 92, -1)  23.107677
202   (2008, 5, 1, 0, 0, 0, 3, 122, -1)  22.912510
203   (2008, 6, 1, 0, 0, 0, 6, 153, -1)  19.431740

[81 rows x 2 columns]

In [76]:
now = datetime.now()

timestamp = datetime.timestamp(now)
print("timestamp =", timestamp)

timestamp = 1658956375.357841